InformationRegisters/_ОписаниеИзмененийВПрограмме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>_ОписаниеИзмененийВПрограмме</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзмененияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/_ОписаниеИзмененийВПрограмме/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    
    Изменения.Очистить();
    ТД = ТекущийОбъект.Изменения.Получить();
    Если Тип("Структура") = ТипЗнч(ТД) тогда
        Если ТД.Свойство("ОписаниеИзменений") 
            И Тип("ТабличныйДокумент") = ТипЗнч(ТД.ОписаниеИзменений) тогда
            Изменения.Вывести(ТД.ОписаниеИзменений);
        КонецЕсли;
        Если ТД.Свойство("Просмотрели")  
            И Тип("Массив") = ТипЗнч(ТД.Просмотрели) тогда
            Просмотрели.ЗагрузитьЗначения(ТД.Просмотрели);
        КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    
    ТД = новый Структура;
    ТД.Вставить("ОписаниеИзменений",Изменения);
    ТД.Вставить("Просмотрели",Просмотрели.ВыгрузитьЗначения());
    ТекущийОбъект.Изменения = новый ХранилищеЗначения(ТД);
    
    Текст = "";
    для стр = 1 по Изменения.ВысотаТаблицы цикл
     Строка = "";
       для столбец = 1 по Изменения.ШиринаТаблицы цикл
            Строка = Строка + ?(СокрЛП(Изменения.Область(стр,столбец).Текст) = "","",СокрЛП(Изменения.Область(стр,столбец).Текст) + " ");
        КонецЦикла;  
        Текст = Текст + Строка + ?(Строка = "","",Символы.ПС);
    КонецЦикла;
    ТекущийОбъект.ИзмененияСтрокой = Текст;
    
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
   
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Параметры.Ключ.Пустой() тогда
        Изменения.Вывести(РегистрыСведений._ОписаниеИзмененийВПрограмме.ПолучитьМакет("Макет").ПолучитьОбласть("Описание"));
        Запись.Период = ТекущаяДата();
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
    ДобавитьСтрокуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуНаСервере()
    Изменения.Вывести(РегистрыСведений._ОписаниеИзмененийВПрограмме.ПолучитьМакет("Макет").ПолучитьОбласть("Описание"),,);
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
    ПериодПриИзмененииНаСервере();
КонецПроцедуры
